# Week 4 demo
## Chirag Rao K V
reg no : 240962180

Sec: PC

In [11]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt

In [24]:
#creating a dataframe
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [25]:
#Transpose of the dataframe
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [27]:
# adding a row to the data frame
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [33]:
#copying data from frame3,everything except last row
pdata = {"Ohio":frame3["Ohio"][:-1],
        "Nevada": frame3["Nevada"][:-1]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [37]:
# Adding  index and column name to dataframe
frame3.index.name = "year"
frame3.columns.name = "State"
frame3

State  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [41]:
#convert dataframe into numpy
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [51]:
#create a Series with index given and 3 elements
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
#store index of series 
index = obj.index
print(index)
#get all emenets of index starting from 2nd element
index[1:]

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

In [54]:
# Label to store the index of Series
labels = pd.Index(np.arange(3))
print(f"labels\n{labels}")
#append the index in label to the series using keyword "index ="
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
print(f"object\n{obj2}")
#Checks if same index is used in obj2
obj2.index is labels

labels
Int64Index([0, 1, 2], dtype='int64')
object
0    1.5
1   -2.5
2    0.0
dtype: float64

True

In [59]:
#get the columns in frame3
frame3,frame3.columns

(State  Ohio  Nevada
 year
 2000    1.5     NaN
 2001    1.7     2.4
 2002    3.6     2.9,
 Index(['Ohio', 'Nevada'], dtype='object', name='State'))

In [56]:
#checks for column named "Ohio" in frame 3
"Ohio" in frame3

True

In [60]:
#Checks for a row named 2003 in frame3
2003 in frame3

False

In [63]:
pd.Index(["haa", "ha", "yah", "ooo"])
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [66]:
# renaming the index of obj2
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [69]:
#Creating obj3 as Series
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [70]:
# reindexing using method = "ffill"
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [73]:
#creating a dataframe shaped 3x3 
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [76]:
# as a new index is added while assigning frame 2 it assigns nan value
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [81]:
# Ohio removed and utha added so "Utha" column has nan
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [87]:
#gets columns and index specified
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [88]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [90]:
#creating a new object and copying data from obj except index c
new_obj = obj.drop("c")
print(new_obj)
#droping rows from series
obj.drop(["d", "c"])

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [91]:
#creating dataframe 
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
#dropping index form dataframe
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
#dropping column
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [95]:
#dropping column using keyword axis  :  axis = 1 specifies columns
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [96]:
# using "columns" in axis
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [102]:
# slicing : get rows till index 2 and all columns
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [100]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
# get the row named "Colorado"
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [105]:
#get the columns of specified row
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [108]:
#access the row using iloc
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [110]:
#access the specified rows in column (row,column(list))
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [111]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [113]:
#access using name [row,column]
data.loc[:"Utah", "two"]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [116]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [119]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1] # get the last element

2.0

In [122]:
#access using iloc
ser2.iloc[-1]

2.0

In [124]:
#get all rows till row index 2
ser2[:2]

a    0.0
b    1.0
dtype: float64

In [126]:
#REASSIGN VALUES
data.loc[data.three == 5, "three"] = 6
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
#CREATE DATAFRAME
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [129]:
df1,df2

(   A
 0  1
 1  2,
    B
 0  3
 1  4)

In [131]:
# combining dataframes with + dosent work
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [132]:
# Combining dataframe using .add
df1.add(df2, fill_value=0)

     A    B
0  1.0  3.0
1  2.0  4.0

In [146]:
1 / df1

     A
0  1.0
1  0.5

In [147]:
# using rdiv() to devide elements 
df1.rdiv(1)

     A
0  1.0
1  0.5

In [148]:
#reindexing and assigning 0 
df1.reindex(columns=df2.columns, fill_value=0)

   B
0  0
1  0

In [139]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [149]:
#subtracting a 2d arry by 1d array
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [150]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [153]:
#assigning first row to series 
series = frame.iloc[0]

In [154]:
frame,series

(          b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0,
 b    0.0
 d    1.0
 e    2.0
 Name: Utah, dtype: float64)

In [155]:
 frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [156]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
frame + series

          b     d     e
Utah    0.0   2.0   4.0
Ohio    3.0   5.0   7.0
Texas   6.0   8.0  10.0
Oregon  9.0  11.0  13.0

In [160]:
series3 = frame["d"]
series3

Utah      0.228913
Ohio     -2.001637
Texas    -0.438570
Oregon    3.248944
Name: d, dtype: float64

In [159]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [161]:
np.abs(frame)

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429  2.001637  0.371843
Texas   1.669025  0.438570  0.539741
Oregon  0.476985  3.248944  1.021228

In [165]:
#define a function to return difference bw max and min
def f1(x):
    return x.max() - x.min()

In [166]:
# using a function for a dataframe
frame.apply(f1)

b    1.394034
d    5.250581
e    2.374144
dtype: float64

In [167]:
# sorting
frame.sort_index()

               b         d         e
Ohio    0.886429 -2.001637 -0.371843
Oregon  0.476985  3.248944 -1.021228
Texas   1.669025 -0.438570 -0.539741
Utah    0.274992  0.228913  1.352917

In [168]:
frame.sort_index(axis="columns")

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429 -2.001637 -0.371843
Texas   1.669025 -0.438570 -0.539741
Oregon  0.476985  3.248944 -1.021228

In [170]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [171]:
 obj.sort_values(na_position="first")

2   -3
3    2
0    4
1    7
dtype: int64

In [172]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [173]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [174]:
 obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [180]:
# checks if index are unique
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj.index.is_unique

False

In [181]:
 df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],  columns=["one", "two"])

In [182]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [183]:
 df.sum()

one    9.25
two   -5.80
dtype: float64

In [184]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [185]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [186]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [187]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [189]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [190]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [191]:
# read the files
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [192]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [195]:
# gets correlation bw two columns
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [196]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [197]:
#returns coorelation matrix
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [200]:
#gets covarience matrix
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [202]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
uniques = obj.unique()
# prints the unique elements
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [203]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [204]:
pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [205]:
obj
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [206]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

NameError: name 'unique_vals' is not defined

In [211]:
data = pd.DataFrame({"Qu1":[1,2,3,4],
                    "QU2":[1,2,3,4],
                    "QU3":[1,2,3,4]})
data

   Qu1  QU2  QU3
0    1    1    1
1    2    2    2
2    3    3    3
3    4    4    4

In [212]:
data["Qu1"].value_counts().sort_index()

1    1
2    1
3    1
4    1
Name: Qu1, dtype: int64

In [214]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  QU2  QU3
1    1    1    1
2    1    1    1
3    1    1    1
4    1    1    1

In [215]:
data = pd.DataFrame({"a":[1,1,1,2,2],
                    "b":[0,0,1,0,0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [217]:
data.values_count()

AttributeError: 'DataFrame' object has no attribute 'values_count'

# Chapter 6

In [220]:
df = pd.read_csv("examples/ex1.csv")
df

   a   b   c   d message
0  1   2   3   4  hellow
1  5   6   7   8   world
2  9  10  11  12     foo

In [222]:
names = ["a", "b", "c", "d", "message"]
pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hellow   1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [224]:
parsed = pd.read_csv("examples/csv_mindex.csv",
                     index_col=["key1", "key2"])
parsed

           value1  vlaue2
key1 key2
one  a          1       2
     b          3       4
     d          5       6
two  a          1       2
     b          3       4
     d          5       6

In [225]:
result = pd.read_csv("examples/ex3.txt", sep="\s+")
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [226]:
 pd.read_csv("examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [227]:
result = pd.read_csv("examples/ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [228]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [229]:
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [230]:
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [231]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [232]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}
pd.read_csv("examples/ex5.csv", na_values=sentinels,
            keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [233]:
result = pd.read_csv("examples/ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [234]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [235]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [236]:
tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

In [238]:
tot = tot.sort_values(ascending=False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [241]:
data = pd.read_csv("examples/ex5.csv")
print(data)
data.to_csv("examples/out.csv")

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [248]:
import sys
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [249]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [250]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [251]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [252]:
import csv
f = open("examples/ex7.csv")
reader = csv.reader(f)
for line in reader:
    print(line)
f.close()
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))
header, values = lines[0], lines[1:]

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [253]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [258]:
 import json
result = json.loads(obj)
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [255]:
asjson = json.dumps(result)
asjson

TypeError: Object of type DataFrame is not JSON serializable

In [256]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])
siblings

KeyError: 'siblings'